import 'package:egyptianyouthcouncil/shared/component/cards.dart';
import 'package:egyptianyouthcouncil/shared/component/text.dart';
import 'package:flutter/material.dart';

class PartnerShip extends StatelessWidget {
  const PartnerShip({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(
      children: [
        text(
            context: context,
            title: 'الشراكات',
            subTitle:
                '''على مدار الخمس سنوات منذ تدشين مجلس الشباب المصري عمل على توسيع شبكة اعلاقات والتشبيك مع الكيانات المختلفة سواء كان على المستوى المحلى أو الإقليمي أو العالمي ايمانًا بأهمية تبادل الخبرات بين المؤسسات المختلفة واكتساب معارف جديدة إلى جانب التوسع في الأنشطة والفاعليات وفي ضوء ذلك وقع المجلس عدد من بوتوكولات التعاون مع: 
          •	مؤسسات المجتمع المدني
          •	الهيئات الإقليمية
          •	الهيئات الدولية
        '''
                    .trim()),
        cardTable(
            ctx: context,
            name: 'حزب الخضر',
            brief:
                'يعمل الحزب على نشر الاهتمام بالقضايا البيئية بين المواطنين، كما يهدف للحفاظ علي البيئة ومواجهة المشكلات البيئية ومواجهة الفقر وغزو الصحراء كأساس لتحقيق نقلة حضارية شاملة. ',
            conBrief: true),
        cardTable(
            ctx: context,
            name: 'المؤسسة الدولية لريادة الأعمال والتنمية',
            conBrief: true,
            conRes: true,
            brief:
                'تقوم المؤسسة الدولية لريادة الأعمال والتنمية المستدامة وهي مؤسسة تنموية غير هادفة للربح ؛ بالتعاون مع مؤسسات المجتمع المدني وقطاع الأعمال العام والخاص ؛لمساعدة الكوادر الرائدة من المؤسسة هي بيت الخبرة للعديد من المنظمات التي يمكن أن تستفيد من مجال ريادة الأعمال بما يحقق التنمية المستدامة في جميع المجالات ؛ ويتأصل دورها في النهوض بالمجتمع المصري والعربي بشتى المجالات',
            res: 'د. غادة الدخاخني'),
        cardTable(
            ctx: context,
            name:
                'أكاديمية القمة العربية الدولية للدراسات المتطورة والبحث العلمي',
            conBrief: true,
            brief:
                'مؤسسة علمية تعنى بشؤون البحث العلمي في جميع المجالات وقضايا التدريب وريادة الأعمال والبحث عن حلول للمشاكل التي يتخبط فيها العالم بالتعاون مع مختلف الباحثين والمؤسسات تظم العديد من المختصين والباحثين بالعديد من المجالات والتخصصات العلمية كما تظم الكثير من رجال الأعمال المنخرطين فيها.'),
        cardTable(
            ctx: context,
            name: 'ديڤا للإنتاج الفني',
            conRes: true,
            res: 'ا. نفين كمال'),
        cardTable(
            ctx: context,
            name: 'مؤسسة أنامل مصرية',
            conRes: true,
            conBrief: true,
            brief:
                'تأهيل طبقة شبابية مثقفة لتقوم بدورها الريادي في المجتمع. تأهيل المرأة وتزويدها بالمهارات اللازمة في كافة المجالات. رفع مستوى الوعي الاجتماعي والقانوني والتربوي لدى المرأة.',
            res: 'ا. عزيزة الزيات '),
        cardTable(
            ctx: context,
            name: 'جمعية محبي الخير لتنمية المجتمع المحلي',
            conRes: true,
            res: 'ا. هناء جرجس'),
        cardTable(
            ctx: context,
            name: 'مؤسسة كاريزما ارتس الفن لتنمية المجتمع',
            conRes: true,
            conBrief: true,
            brief:
                'العمل علي تأهيل وتدريب وتطوير المهارات العامة لضحايا النزاعات من الأطفال والنساء من اللاجئين والمهاجرين والعمل على دعمهم علي كافة الأصعدة التنموية والعمل علي تنفيذ مجموعة من المشروعات التنموية المشتركة بإستخدام الفن',
            res: 'المهندسة فيفان لبيب'),
        cardTable(
            ctx: context,
            name: 'جمعية النماء لتنمية المجتمع',
            conBrief: true,
            conRes: true,
            brief:
                'العمل على رفع مستوى الأسر الفقيرة اجتماعيًا ومعنويًا وصحيًا وماديًا ودينيًا',
            res: 'ا. ولاء جمال'),
        cardTable(
            ctx: context,
            name: 'مؤسسة المرأة المصرية و الأفريقية',
            conRes: true,
            conBrief: true,
            brief:
                'العمل على تمكين المرأة في المجتمعات العربية والأفريقية وحمايتها ضد العنف والتمييز بكافة أشكاله، عن طريق محاور عدة منها التوعية والتدريب والصحة والتعليم.',
            res: 'السفيرة نجوى إبراهيم'),
        cardTable(
            ctx: context,
            name: 'جمعية الحلم العربي للعمل الإنساني والتنمية المستدامة',
            conBrief: true,
            conRes: true,
            res: 'د. عبير سليمان ',
            brief:
                'يهدف هذا الاتحاد إلى بناء جسور تعاون بين جميع النساء وبين منظمة أفريقية دولية.'),
        cardTable(
            ctx: context,
            name: 'المجموعة المصرية للدراسات البرلمانية .',
            conRes: true,
            conBrief: true,
            brief:
                'تهدف المجموعة المصرية للدراسات البرلمانية إلى تنمية منظومة البحوث والدراسات البرلمانية وتعزيز دور النخب العلمية والثقافية في الممارسة السياسية وتعميم ثقافة البحث بالإضافة لرعاية شباب الباحثين والأكاديميين وتوفير الفرصة لهم لتنمية مهاراتهم وإبراز قدراتهم',
            res: 'ا. عبد الناصر قنديل'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'النقابة العامة للفلاحين  ',
            brief:
                'الدفاع عن الفلاحين والمربين وتقديم العون اللازم لهم من مشورة فنية ودعم مادي وفني لنشاطهم وذلك بالتنسيق مع أمانة الزراعة والثروة الحيوانية.غرس الروح المهنية في نفوس الفلاحين والمربين وحثهم على اعتماد هذا النشاط الاقتصادي لتامين العيش الكريم لهم و لأسرهم و لتحقيق مردود اقتصادي وطني مشرف. \nغرس روح الانتماء العربي و المغاربي و اتخاذ التضامن النقابي وسيلة ترسيخ ودفاع عن حرية العمل النقابي.استزراع الفلاحين بالبذور والتقاوي والأسمدة والشتول بأسعار منخفضة أي بدعم الدولة، كما هو الشأن بالنسبة لأعلاف ولقاحات الحيوانات والدواجن، كما تشجع الدولة على تربية خلايا النحل وتقدم المشورة الفنية للمربين .'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'حملة المحليات للشباب محافظة الجيزة  ',
            brief:
                'تمكين الشباب من المشاركة في الحياة السياسية وصنع القرار، وخلق جيل من القيادات الواعية بمفاهيم الخدمة العامة و القادرة على القيادة بكفاءة من خلال إعداد برنامج متكامل للإنتقاء والتدريب والتأهيل'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'نقابة المخترعين المصريين  ',
            brief:
                'تهدف النقابة إلى الدفاع عن حقوق الملكية الفكرية لأعضاء النقابة وذلك بكل الأساليب القانونية المتاحة وعمل حلقة اتصال بأجهزة الدولة المعنية وعمل الإجراءات اللازمة لضمان حقوق المخترعين مساعدة الأعضاء المخترعين بكل الوسائل المتاحة والمتيسرة لإيجاد الحلول المناسبة لمشكلات التطبيق العملي لمخترعاتهم المودعة لدي النقابة حتى تكون في متناول المتخصصين في المجالات السعي بكل الوسائل لربط الأبحاث والاختراعات الخاصة بأعضاء'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'مكتبة مصر العامة',
            brief:
                'تهدف المكتبة إلى تشجيع الأفراد من كافة الأعمار والفئات على تنمية عادة القراءة والاستفادة من المواد الثقافية والتعليمية المتاحة بالمكتبة وتنمية هذه المواد وتحديثها بما يفي برغبات واحتياجات أعضاءها، كما تهدف إلى توفير وسائل التعليم الذاتي مدى الحياة.'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'الهيئة العامة لقصور الثقافة',
            brief:
                'الهيئة العامة لقصور الثقافة إحدى المؤسسات الثقافية المصرية ذات الدور البارز في تقديم الخدمات الثقافية والفنية وقد وجدت في أوائل القرن العشرين قبل وجود وزارة الثقافة، فقد بدأ دورها كفكرة تمثلت في إيجاد مدارس للشعب لتعليم الكبار'),
        cardTable(
            ctx: context,
            conBrief: true,
            name: 'جمعية المترجمين واللغويين',
            brief:
                'كيان تتوحد من خلاله جهود المترجمين واللغويين والمبدعين وخبراتهم وإمكانياتهم، وهي بذلك تحقق التواصل المباشر بين قطاعات عريضة من فئات مميزة يمكنها أن تستفيد بما لدى بعضهم البعض من علم ومعرفة وإمكانيات، وهي ليست مؤسسة يحركها هدف الربحية، وإنما هي تسعى لخلق نهضة شاملة تعود فائدتها على المترجم، وصناعة الترجمة، وعلى المجتمع.'),
        cardTable(
            ctx: context,
            conBrief: true,
            conRes: true,
            name: 'جمعية الحقوقيات المصريات',
            brief:
                'تسعي جمعية الحقوقيات المصريات إلي خلق نساء مصريات قادرات علي الدفاع عن حقوقهن و العمل علي نشر قيم المساواة بين الجنسين و العدالة والحرية. وضمان أن المرأة المصرية ليست فقط على علم بحقوقها وإنما علي دراية أيضا بكيفية وضع و تصميم القانون لحماية هذه الحقوق.',
            res: 'ا. رابحة'),
        cardTable(
            ctx: context,
            conBrief: true,
            conRes: true,
            name: 'كلية شئون البيئة جامعة عين شمس ',
            brief:
                'يحرص قطاع شؤون خدمة المجتمع وتنمية البيئة من خلال العديد من الأنشطة والفاعليات على تقديم العديد من الخدمات المختلفة التي يمكنها أن تعمل على الرقي بالمجتمع وتنميته من ناحية، إلى جانب إشراك الطلاب في التفاعل المجتمعي وبذر روح التعاون في نفوسهم ليكونوا أكثر فعالية وخدمة لموطنهم',
            res: 'د. نهى سمير'),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية المصريين لتنمية المجتمع بأسيوط',
            res: 'أ/ قطامش رياض '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'اكاديمية الجزيرة للاعلام وعلوم الاتصال',
            res: 'أ.د/ محمد معوض '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية تنمية المجتمع بكفر الشرفا ',
            res: 'أ/ أحمد حلمي عبدالمجيد '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'الجمعية العربية للتنمية البشرية والبيئة ',
            res: 'د/ رباب حسانين '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية المرأة والمجتمع ',
            res: 'أ/ سهام السعيد نجم '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'شباب مصر للتنمية بالمشاركة لتنمية المجتمع بسوهاج ',
            res: 'أ/ نجلاء عبدالصادق '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'مؤسسة محبي بمصر الاهلية بدمنهور البحيرة ',
            res: 'أ/ ليلى ذكي'),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'نقابة المخترعين المصريين ',
            res: 'د/ هبة أحمد عبدالحافظ '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية خريجي اكاديمية المستقبل ',
            res: 'د/ ياسر مهران '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية المترجمين اللغويين المصريين',
            res: 'د/ حسام الدين مصطفى'),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية تنمية المجتمع بالعزية',
            res: 'أ/ منتصر مالك يعقوب'),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'جمعية صوت العياط للاعمال الخيرية',
            res: 'أ/ الخطيب عواد صادق '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'الجمعية المصرية لمساعدة الأحداث وحقوق الإنسان',
            res: 'أ/ محمود البدوي'),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'شركة بيزنس انترناشونال جروب ',
            res: 'أ/ على محمد على '),
        cardTable(
            ctx: context,
            conRes: true,
            name: 'IT SHARKS COMPANY',
            res: 'م/ محمود احمد الصفتي '),
        text(
            context: context,
            title: 'شراكات اخري',
            subTitle: '''
              •	مؤسسة تحيا مصر للاعمال الخيرية وتنمية المجتمع 
•	النقابة العامة للمحامين
•	جمعية صوت العياط للاعمال الخيرية
•	الاتحاد العام لعمال مصر
•	مركز شباب اسيوط الهيئات الإقليمية
            '''
                .trim()),
      ],
    ));
  }
}
